Repository: dolcevitadog/dolcevitadog
Catalog: sites/all/translations/commerce_stock-7.x-2.3.*.po
Languages: fr

source: Prefix
fr: Préfixe

source: Suffix
fr: Suffixe

source: Submit
fr: Soumettre

source: Cancel
fr: Annuler

source: Order
fr: Ordre

source: Product
fr: Produit

source: product
fr: produit

source: Stock management
fr: Gestion du stock

source: User message
fr: Message utilisateur

source: Out of stock
fr: Rupture de stock

source: Processed @current out of @total.
fr: @current sur @total traité(s).

source: Custom URL
fr: URL personnalisée

source: Line item
fr: Élément de commande

source: An error occurred while processing @operation with arguments : @args
fr: Une erreur est survenue lors du traitement de @operation avec pour arguments : @args

source: Custom HTML
fr: HTML personnalisé

source: Order has products that are out of stock
fr: La commande contient des produits en rupture de stock

source: Modified stock level of product %sku by %amount
fr: Niveau de stock du produit %sku modifié de %amount

source: Failed attempt to modify stock level of product %sku by %amount
fr: La tentative de modification du niveau de stock du produit %sku de %amount a échoué

source: Configure stock management.
fr: Configurer la gestion du stock.

source: Enable stock management for these product types
fr: Activer la gestion des stocks pour ces types de produits

source: Note that disabling stock management removes the Stock field from the product type, deleting any existing stock data for that product type.
fr: Veuillez noter que le fait de désactiver la gestion du stock retire les champs Stock du Type de Produit, supprimant ainsi toutes les données de stock existantes pour ce Type de Produit.

source: I understand that all stock data will be permanently removed from the product @type_plural %product_types.
fr: Je comprends que toutes les données de stock seront définitivement supprimées du produit @type_plural %product_types.

source: You must click the confirmation checkbox to confirm that you want to delete stock data
fr: Vous devez cocher la case de confirmation pour confirmer que vous voulez supprimer les données de stock

source: Please check the "I understand" checkbox to indicate you understand that all stock data in these fields will be deleted: %fields.
fr: Veuillez cocher la case "Je comprends" pour indiquer que vous comprenez que toutes données de stock des champs suivants seront supprimées : %fields.

source: Stock management has been disabled on the %type product type
fr: La gestion du stock a été désactivée pour le type de produit %type

source: Decrease the product stock level, given a line item
fr: Décrémenter le niveau de stock des produits d'un élément de commande donné

source: Increase the product stock level, given a line item
fr: Incrémenter le niveau de stock des produits d'un élément de commande donné

source: Disable stock for this product
fr: Désactiver le stock pour ce produit

source: Requested Quantity
fr: Quantité demandée

source: Quantity already ordered (in the cart)
fr: Quantité déjà commandée (dans le panier)

source: Quantity requested + already ordered
fr: Quantité demandée + déjà commandée

source: Approved Quantity
fr: Quantité approuvée

source: Set the state of the add to cart form
fr: Définir l'état du formulaire d'ajout au panier

source: Quantity already ordered
fr: Quantité déjà commandée

source: Stock management API
fr: API de gestion du stock

source: Stock level (int)
fr: Niveau de stock (entier)

source: The stock level as an integer
fr: Le niveau de stock sous la forme d'un nombre entier

source: Stock level available for the user
fr: Stock disponible pour l'utilisateur

source: The available stock level for the current user
fr: Le stock disponible pour l'utilisateur actuel

source: Simple Stock management
fr: Gestion simple du stock

source: Advanced configuration of the add to cart form
fr: Configuration avancée du formulaire d'ajout au panier
