Repository: dolcevitadog/dolcevitadog
Catalog: sites/all/translations/commerce_cheque-7.x-1.1.*.po
Languages: fr

source: Title
fr: Titre

source: Reference
fr: Référence

source: Information
fr: Informations

source: Cash
fr: Encaisser

source: Payee name
fr: Nom de la personne payée

source: Override the default title of the commerce cheque payment method.
fr: Supplanter le titre par défaut de la méthode de paiement par chèque de Commerce.

source: Cashing the cheque means that the cheque has been verified and cashed
fr: L'encaissement du chèque signifie que le chèque a été vérifié et encaissé

source: Cheque date
fr: Date du chèque

source: Enter cheque date here
fr: Saisir la date du chèque ici

source: Enter cheque payee name here
fr: Saisir le nom de l'émetteur du chèque ici

source: Enter cheque reference number here
fr: Saisir le numéro de référence du chèque ici

source: Cheque status
fr: Statut du chèque

source: Select the cheque deposit status here
fr: Sélectionnez le statut de dépôt du chèque ici

source: The cheque for this order has been cashed
fr: Le chèque pour cette commande a été encaissé

source: Pay by cheque
fr: Payer par chèque

source: This order is waiting for the cheque to be cashed.
fr: La commande est en attente de l'encaissement du chèque.

source: Cheque settings
fr: Paramètres des chèques

source: Override the title of the Commerce Cheque Payment method
fr: Supplanter le titre par défaut de la méthode de paiement par chèque de Commerce.

source: Commerce Pay by Cheque
fr: Commerce Payer par Chèque

source: Adds a "Pay by cheque" payment method
fr: Ajoute le mode de paiement "Payer par chèque"
